# Projeto de Bases de Dados - Parte 2

### Docente Responsável

Prof. FirstName LastName

### Grupo GG
<dl>
    <dt>HH horas (33.3%)</dt>
    <dd>istxxxxxxxx FirstName LastName</dd>
    <dt>HH horas (33.3%)</dt>
    <dd>istxxxxxxxx FirstName LastName</dd>
    <dt>HH horas (33.3%)</dt>
    <dd>istxxxxxxxx FirstName LastName</dd>
<dl>

# Empresa de comércio online

## 1 Conversão E-A para Modelo Relacional

Recorde a notação para o Modelo Relacional exposta nas aulas teóricas como se segue:

- relacaoA (<u>atributo1</u>, … , atributoN)
    - atributoX, … , atributoZ: FK (RelacaoDestino)
    - unique(atributoA, … , AtributoC)
- relacaoB (<u>atributo1</u>, … , atributoN)
    - atributoX, … , atributoZ: FK (RelacaoDestino)
    - unique(atributoA, … , AtributoC)

1. As relações são expressas por um nome seguido dos atributos entre parêntesis;
    - As chave primárias são expressas sublinhando os atributos que a compõem;
    - As chaves estrangeiras para outras relações são expressas através da lista de atributos que a compõem, seguida de “: FK(RelacaoDestino)”. A ordem dos atributos que compõem a FK deve corresponder à ordem dos atributos da chave na relação destino;
    - As chaves candidatas são expressas através da expressão “unique”, seguida da lista de atributos que a compõem entre parêntesis;
    - As restrições de integridade ao Modelo Relacional são descritas em termos dos conceitos deste modelo.

### 1.1 Modelo Relacional com Restrições de Integridade

1. Desenvolva um Modelo Relacional correspondente ao modelo Entidade-Associação;
2. Complemente a seu Modelo Relacional com um conjunto de Restrições de Integridade que represente o modelo E-A apresentado com a maior fidelidade.

- Department(<u>name</u>)

- Employee(<u>ssn</u>, TIN, bdate, name)
	- UNIQUE(TIN)

- Workplace(<u>address</u>, lat, long)
	- UNIQUE(lat,long)

- works(<u>ssn</u>, <u>name</u>, <u>address</u>)
	- ssn: FK(Emplyee)
	- name: FK(Department)
	- address: FK(Workplace)

- Order(<u>order_no</u>, date, cust_no)
	- cust_no: FK(Customer) NOT NULL

- process(<u>ssn</u>, <u>order_no</u>)
	- ssn: FK(Emplyee)
	- order_no: FK(Order)

- Customer(<u>cust_no</u>, name, email, phone, address)
	- UNIQUE(email)

- Sale(<u>order_no</u>)
	- order_no: FK(Order)

- pay(cust_no, <u>order_no</u>)
	- cust_no: FK(Customer)
	- order_no: FK(Sale)

- Office(<u>address</u>)
	- address: FK(Workplace)

- Warehouse(<u>address</u>)
	- address: FK(Workplace)

- Product(<u>sku</u>, name, description, price)

- EAN Product(<u>sku</u>, ean)
	- sku: FK(Product)

- Supplier(<u>TIN</u>, sku, name, address, date)
	- sku: FK(Product) NOT NULL

- contains(<u>order_no</u>, <u>sku</u>, qty)
	- order_no: FK(Order)
	- sku: FK(Product)

- delivery(<u>address</u>, <u>sku</u>, <u>TIN</u>)
	- address: FK(Warehouse)
	- sku: FK(Product)
	- TIN: FK(Supplier)


- RI-1: lat e long são únicos como par
- RI-2: Quando uma Order é retirada da base de dados, tem de se tirar também a Sale associada ao mesmo order_no.
- RI-3: Quando um Workplace é retirado da base de dados, tem de se tirar o Office e Warehouse associados ao mesmo address
- RI-4: Qualquer sku em Product tem de estar também em Supplier
- RI-5: Qualquer chave order_no em Order tem de existir em contains
- RI-6: Qualquer chave ssn em Employee tem de existir em works

### 1.2 Restrições de Integridade não passíveis de conversão

Identifique todas as Restrições de Integridade do modelo Entidade-Associação apresentado que não são passíveis de conversão para o modelo relacional.

- RI-7: Customer só podem pagar Sale de uma Order que eles tenham encomendado

## 2 Algebra Relacional

Recorde a notação exposta nas aulas teóricas como se segue:

$\Pi_{atributo1} \big( \sigma_{atributo1=atributo2} (relacaoA \bowtie relacaoB) \big)$

#### Simbolos
- $\cup$ union 			
- $\cap$ intersection 		
- $-$ difference 		
- $\times$ cartesian product 
- $\div$ division 			
- $\rho$ rename 			
- $\bowtie$ natural join 		
- $\wedge$ Logical AND 	
- $\vee$ Logical OR 	
- $\neg$ Logical NOT 	

Considerando o modelo relacional desenvolvido, apresente as expressões algébricas correspondentes a cada uma das seguintes interrogações:

1. Liste o nome de todos os clientes que fizeram encomendas contendo produtos de preço superior a €50 no ano de 2023;

$\Pi_{c.cust\_no}(\sigma_{\text{YEAR}(o.date)=2023\&amp;p.price>50}(\text{Customer}\bowtie_{c.cust\_no=o.cust\_no}\text{Orders}\bowtie_{o.order\_no=ct.order\_no}\text{contains}\bowtie_{ct.sku=p.sku}\text{Product}))$

2. Liste o nome de todos os empregados que trabalham em armazéns e não em escritórios e processaram encomendas em Janeiro de 2023;

$\Pi_{e.name}(\sigma_{\text{MONTH}(o.date)=1\&\text{YEAR}(o.date)=2023\&\text{of.address IS NULL}}((Employee\bowtie_{e.ssn=pr.ssn}\text{process})\bowtie_{pr.order\_no=o.order\_no}\text{Orders}\bowtie_{d.address=w.address}\text{Warehouse}\ltimes_{e.address=of.address}\text{Office}))$

3. Indique o nome do produto mais vendido;

$\Pi_{p.name}(\text{Product}\bowtie_{p.sku=con.sku}(\text{contains}\bowtie_{con.order\_no=s.order\_no}\text{Sale}))\ltimes\text{LIMIT}(1,SUM(con.qty),\text{DESC})$

4. Indique o valor total de cada venda realizada.

$\Pi_{s.order\_no,SUM(p.price*con.qty)\text{ AS total\_value}}(\text{Sale}\bowtie_{s.order\_no=con.order\_no}(\text{contains}\bowtie_{con.sku=p.sku}\text{Product}))\gamma_{s.order\_no}(s.order\_no,SUM(p.price*con.qty))$

## 3 Tradução do Modelo Relacional para SQL

### 3.1 Esquema Relacional (schema.sql)

Crie uma base de dados SQL correspondente ao esquema Relacional desenvolvido no ponto anterior.
Utilizando a linguagem SQL (DDL), apresente as instruções para criar o esquema de bases de dados correspondente ao modelo relacional desenvolvido. Deve certificar-se de que os tipos de dados e tamanhos de campo selecionados sejam os mais apropriados. As restrições aplicáveis a cada campo, linha e tabela também devem ser especificadas recorrendo às instruções NOT NULL, CHECK, PRIMARY KEY, UNIQUE e FOREIGN KEY conforme seja apropriado.


Nota: Apresente todas as restrições existentes no modelo Relacional que não podem ser capturadas (implementadas) no esquema SQL, escrevendo-as como comentários na tabela respectiva.

In [1]:
%load_ext sql
%sql postgresql://db:db@postgres/db

In [8]:
%%sql
drop table if exists Department cascade;
drop table if exists Employee cascade;
drop table if exists Workplace cascade;
drop table if exists works cascade;
drop table if exists Orders cascade;
drop table if exists process cascade;
drop table if exists Customer cascade;
drop table if exists Sale cascade;
drop table if exists pay cascade;
drop table if exists Office cascade;
drop table if exists Warehouse cascade;
drop table if exists Product cascade;
drop table if exists EAN_Product cascade;
drop table if exists Supplier cascade;
drop table if exists contains cascade;
drop table if exists delivery cascade;

-- Create the Department table
CREATE TABLE Department (
    name VARCHAR(255) PRIMARY KEY
);

-- Create the Employee table
CREATE TABLE Employee (
    ssn INT PRIMARY KEY,
    TIN INT UNIQUE,
    bdate DATE,
    name VARCHAR(255)
);

-- Create the Workplace table
CREATE TABLE Workplace (
    address VARCHAR(255) PRIMARY KEY,
    lat DECIMAL(9, 6),
    long DECIMAL(9, 6),
    UNIQUE (lat, long)
);

-- Create the works table
CREATE TABLE works (
    ssn INT,
    name VARCHAR(255),
    address VARCHAR(255),
    FOREIGN KEY (ssn) REFERENCES Employee(ssn),
    FOREIGN KEY (name) REFERENCES Department(name),
    FOREIGN KEY (address) REFERENCES Workplace(address),
    PRIMARY KEY (ssn, name, address)
);

-- Create the Customer table
CREATE TABLE Customer (
    cust_no INT PRIMARY KEY,
    name VARCHAR(255),
    email VARCHAR(255) UNIQUE,
    phone VARCHAR(255),
    address VARCHAR(255)
);

-- Create the Order table
CREATE TABLE Orders (
    order_no INT PRIMARY KEY,
    date DATE,
    cust_no INT,
    cust_name VARCHAR(255) NOT NULL,
    FOREIGN KEY (cust_no) REFERENCES Customer(cust_no)
);

-- Create the Sale table
CREATE TABLE Sale (
    order_no INT,
    FOREIGN KEY (order_no) REFERENCES Orders(order_no),
    PRIMARY KEY (order_no)
);

-- Create the pay table
CREATE TABLE pay (
    cust_no INT,
    order_no INT,
    FOREIGN KEY (cust_no) REFERENCES Customer(cust_no),
    FOREIGN KEY (order_no) REFERENCES Sale(order_no),
    PRIMARY KEY (order_no)
);

-- Create the Office table
CREATE TABLE Office (
    address VARCHAR(255),
    FOREIGN KEY (address) REFERENCES Workplace(address),
    PRIMARY KEY (address)
);

-- Create the Warehouse table
CREATE TABLE Warehouse (
    address VARCHAR(255),
    FOREIGN KEY (address) REFERENCES Workplace(address),
    PRIMARY KEY (address)
);

-- Create the Product table
CREATE TABLE Product (
    sku INT PRIMARY KEY,
    name VARCHAR(255),
    description VARCHAR(255),
    price DECIMAL(10, 2)
);

-- Create the EAN Product table
CREATE TABLE EAN_Product (
    sku INT,
    ean VARCHAR(255),
    FOREIGN KEY (sku) REFERENCES Product(sku),
    PRIMARY KEY (sku)
);

-- Create the Supplier table
CREATE TABLE Supplier (
    TIN INT UNIQUE,
    sku INT NOT NULL,
    name VARCHAR(255),
    address VARCHAR(255),
    date DATE,
    FOREIGN KEY (sku) REFERENCES Product(sku),
    PRIMARY KEY (TIN, sku)
);

-- Create the contains table
CREATE TABLE contains (
    order_no INT,
    sku INT,
    qty INT,
    FOREIGN KEY (order_no) REFERENCES Orders(order_no),
    FOREIGN KEY (sku) REFERENCES Product(sku),
    PRIMARY KEY (order_no, sku)
);

-- Create the delivery table
CREATE TABLE delivery (
    address VARCHAR(255),
    sku INT,
    TIN INT,
    FOREIGN KEY (address) REFERENCES Warehouse(address),
    FOREIGN KEY (sku) REFERENCES Product(sku),
    FOREIGN KEY (TIN) REFERENCES Supplier(TIN),
    PRIMARY KEY (address, sku, TIN)
);

-- Create the process table
CREATE TABLE process (
    ssn INT,
    order_no INT,
    FOREIGN KEY (ssn) REFERENCES Employee(ssn),
    FOREIGN KEY (order_no) REFERENCES Orders(order_no),
    PRIMARY KEY (ssn, order_no)
);

*  postgresql://db:***@postgres/db
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

### 3.2 Carregamento da Base de Dados

Crie um script SQL (DML) com todas as instruções INSERT necessárias para criar alguns dados de teste sintéticos para facilitar a validação dos resultados esperados das consultas (lembre-se de que cada tabela deve conter pelo menos uma linha e que todas as consulta têm de retornar um resultado não vazio).

In [9]:
%%sql
-- populate.sql

-- INSERT ...
-- Insert data into the Department table
INSERT INTO Department (name) VALUES
    ('Sales'),
    ('Marketing'),
    ('Finance'),
    ('Human Resources'),
    ('IT');

-- Insert data into the Employee table
INSERT INTO Employee (ssn, TIN, bdate, name) VALUES
    (1, 12345, '1990-05-15', 'John Doe'),
    (2, 67890, '1985-09-28', 'Jane Smith'),
    (3, 54321, '1993-02-10', 'Michael Johnson'),
    (4, 98765, '1988-11-21', 'Emily Davis'),
    (5, 24680, '1991-07-07', 'David Brown');

-- Insert data into the Workplace table
INSERT INTO Workplace (address, lat, long) VALUES
    ('123 Main St', 40.123456, -75.987654),
    ('456 Elm St', 40.987654, -75.123456),
    ('789 Oak St', 40.654321, -75.567890),
    ('321 Pine St', 40.567890, -75.654321),
    ('654 Maple St', 40.876543, -75.432109);

-- Insert data into the works table
INSERT INTO works (ssn, name, address) VALUES
    (1, 'Sales', '123 Main St'),
    (2, 'Marketing', '456 Elm St'),
    (3, 'Finance', '789 Oak St'),
    (4, 'Human Resources', '321 Pine St'),
    (5, 'IT', '654 Maple St');

-- Insert data into the Customer table
INSERT INTO Customer (cust_no, name, email, phone, address) VALUES
    (1, 'John Smith', 'john@example.com', '123-456-7890', '123 Main St'),
    (2, 'Jane Johnson', 'jane@example.com', '987-654-3210', '456 Elm St'),
    (3, 'Michael Davis', 'michael@example.com', '456-789-0123', '789 Oak St'),
    (4, 'Emily Wilson', 'emily@example.com', '789-012-3456', '321 Pine St'),
    (5, 'David Thompson', 'david@example.com', '012-345-6789', '654 Maple St');
    
-- Insert data into the Order table
INSERT INTO Orders (order_no, cust_no, date, cust_name) VALUES
    (1, 1, '2023-05-01', 'John Smith'),
    (2, 2, '2023-05-02', 'Jane Johnson'),
    (3, 3, '2023-05-03', 'Michael Davis'),
    (4, 4, '2023-05-04', 'Emily Wilson'),
    (5, 5, '2023-05-05', 'David Thompson');
    
-- Insert data into the process table
INSERT INTO process (ssn, order_no) VALUES
    (1, 1),
    (2, 2),
    (3, 3),
    (4, 4),
    (5, 5);

-- Insert data into the Sale table
INSERT INTO Sale (order_no) VALUES
    (1),
    (2),
    (3),
    (4),
    (5);

-- Insert data into the pay table
INSERT INTO pay (cust_no, order_no) VALUES
    (1, 1),
    (2, 2),
    (3, 3),
    (4, 4),
    (5, 5);

-- Insert data into the Office table
INSERT INTO Office (address) VALUES
    ('123 Main St'),
    ('789 Oak St');
    
-- Insert data into the Product table
INSERT INTO Product (sku, name, description, price) VALUES
    (1, 'Product 1', 'Description 1', 10.99),
    (2, 'Product 2', 'Description 2', 60.99),
    (3, 'Product 3', 'Description 3', 15.99),
    (4, 'Product 4', 'Description 4', 12.99),
    (5, 'Product 5', 'Description 5', 9.99);

-- Insert data into the EAN_Product table
INSERT INTO EAN_Product (sku, ean) VALUES
    (1, '1234567890123'),
    (2, '2345678901234'),
    (3, '3456789012345'),
    (4, '4567890123456'),
    (5, '5678901234567');

-- Insert data into the Supplier table
INSERT INTO Supplier (TIN, sku, name, address, date) VALUES
    (12345, 1, 'Supplier 1', 'Supplier Address 1', '2022-01-01'),
    (23456, 2, 'Supplier 2', 'Supplier Address 2', '2022-02-01'),
    (34567, 3, 'Supplier 3', 'Supplier Address 3', '2022-03-01'),
    (45678, 4, 'Supplier 4', 'Supplier Address 4', '2022-04-01'),
    (56789, 5, 'Supplier 5', 'Supplier Address 5', '2022-05-01');

-- Insert data into the contains table
INSERT INTO contains (order_no, sku, qty) VALUES
    (1, 1, 2),
    (2, 2, 1),
    (3, 3, 3),
    (4, 4, 2),
    (5, 5, 4);
    
-- Insert data into the Warehouse table
INSERT INTO Warehouse (address) VALUES
    ('456 Elm St'),
    ('321 Pine St');

-- Insert data into the delivery table
INSERT INTO delivery (address, sku, TIN) VALUES
    ('456 Elm St', 1, 12345),
    ('321 Pine St', 2, 23456),
    ('456 Elm St', 3, 34567),
    ('321 Pine St', 4, 45678);

*  postgresql://db:***@postgres/db
5 rows affected.
5 rows affected.
5 rows affected.
5 rows affected.
5 rows affected.
5 rows affected.
5 rows affected.
5 rows affected.
5 rows affected.
2 rows affected.
5 rows affected.
5 rows affected.
5 rows affected.
5 rows affected.
2 rows affected.
4 rows affected.

[]

## 4 Linguagem SQL

Apresente a expressão SQL correspondente  a cada uma das interrogações de Álgebra Relacional.

1. Liste o nome de todos os clientes que fizeram encomendas contendo produtos de preço superior a €50 no ano de 2023;

In [15]:
%%sql
SELECT DISTINCT c.name
FROM Customer c
JOIN Orders o ON c.cust_no = o.cust_no
JOIN contains ct ON o.order_no = ct.order_no
JOIN Product p ON ct.sku = p.sku
WHERE o.date > '2023-01-01' AND p.price > 50;

*  postgresql://db:***@postgres/db
1 rows affected.

[('Jane Johnson',)]

2. Liste o nome de todos os empregados que trabalham em armazéns e não em escritórios e processaram encomendas em Janeiro de 2023;

In [17]:
%%sql
SELECT DISTINCT e.name
FROM Employee e
JOIN process pr ON e.ssn = pr.ssn
JOIN Orders o ON pr.order_no = o.order_no
JOIN Warehouse w ON d.address = w.address --so os que não são NULL
LEFT JOIN Office of ON e.address = of.address --para incluir os NULL
WHERE MONTH(o.date) = 1 AND YEAR(o.date) = 2023 AND of.address IS NULL;

*  postgresql://db:***@postgres/db
(psycopg2.errors.UndefinedTable) missing FROM-clause entry for table "d"
LINE 5: JOIN Warehouse w ON d.address = w.address --so os que não sã...
                            ^

[SQL: SELECT DISTINCT e.name
FROM Employee e
JOIN process pr ON e.ssn = pr.ssn
JOIN Orders o ON pr.order_no = o.order_no
JOIN Warehouse w ON d.address = w.address --so os que não são NULL
LEFT JOIN Office of ON e.address = of.address --para incluir os NULL
WHERE MONTH(o.date) = 1 AND YEAR(o.date) = 2023 AND of.address IS NULL;]
(Background on this error at: https://sqlalche.me/e/20/f405)

3. Indique o nome do produto mais vendido;

In [18]:
%%sql

SELECT p.name
FROM Product p
JOIN contains con ON p.sku = con.sku
JOIN Sale s ON con.order_no = s.order_no
GROUP BY p.name
ORDER BY SUM(con.qty) DESC
LIMIT 1; --Limitar ao primeiro

*  postgresql://db:***@postgres/db
1 rows affected.

[('Product 5',)]

4. Indique o valor total de cada venda realizada.

In [20]:
%%sql
SELECT s.order_no, SUM(p.price * con.qty) AS total_value
FROM Sale s
JOIN contains con ON s.order_no = con.order_no
JOIN Product p ON con.sku = p.sku
GROUP BY s.order_no;

*  postgresql://db:***@postgres/db
5 rows affected.

[(2, Decimal('60.99')),
 (5, Decimal('39.96')),
 (4, Decimal('25.98')),
 (3, Decimal('47.97')),
 (1, Decimal('21.98'))]